hpmicro/hpm_sdk/soc/HPM5300/HPM5301/hpm_csr_regs.h
/*
 * ECCEN (RW)
 *
 * Parity/ECC enable control:
 * 0:Disable parity/ECC
 * 1:Reserved
 * 2:Generate exceptions only on uncorrectable parity/ECC errors
 * 3:Generate exceptions on any type of parity/ECC errors
 */
#define CSR_MDLMB_ECCEN_MASK (0x6U)
#define CSR_MDLMB_ECCEN_SHIFT (1U)
#define CSR_MDLMB_ECCEN_SET(x) (((uint32_t)(x) << CSR_MDLMB_ECCEN_SHIFT) & CSR_MDLMB_ECCEN_MASK)
#define CSR_MDLMB_ECCEN_GET(x) (((uint32_t)(x) & CSR_MDLMB_ECCEN_MASK) >> CSR_MDLMB_ECCEN_SHIFT)

/*
 * DEN (RO)
 *
 * DLM enable control:
 * 0:DLM is disabled
 * 1:DLM is enabled
 */
#define CSR_MDLMB_DEN_MASK (0x1U)
#define CSR_MDLMB_DEN_SHIFT (0U)
#define CSR_MDLMB_DEN_GET(x) (((uint32_t)(x) & CSR_MDLMB_DEN_MASK) >> CSR_MDLMB_DEN_SHIFT)

/* Bitfield definition for register: MECC_CODE */
/*
 * INSN (RO)
 *
 * Indicates if the parity/ECC error is caused by instruction fetch or data access.
 * 0:Data access
 * 1:Instruction fetch
 */
#define CSR_MECC_CODE_INSN_MASK (0x400000UL)
#define CSR_MECC_CODE_INSN_SHIFT (22U)
#define CSR_MECC_CODE_INSN_GET(x) (((uint32_t)(x) & CSR_MECC_CODE_INSN_MASK) >> CSR_MECC_CODE_INSN_SHIFT)

/*
 * RAMID (RO)
 *
 * The ID of RAM that caused parity/ECC errors.
 * This bit is updated on parity/ECC error exceptions.
 * 0–1:Reserved
 * 2:Tag RAM of I-Cache
 * 3:Data RAM of I-Cache
 * 4:Tag RAM of D-Cache
 * 5:Data RAM of D-Cache
 * 6:Tag RAM of TLB
 * 7:Data RAM of TLB
 * 8:ILM
 * 9:DLM
 * 10–15:Reserved
 */
#define CSR_MECC_CODE_RAMID_MASK (0x3C0000UL)
#define CSR_MECC_CODE_RAMID_SHIFT (18U)
#define CSR_MECC_CODE_RAMID_GET(x) (((uint32_t)(x) & CSR_MECC_CODE_RAMID_MASK) >> CSR_MECC_CODE_RAMID_SHIFT)

/*
 * P (RO)
 *
 * Precise error. This bit is updated on parity/ECC error exceptions.
 * 0:Imprecise error
 * 1:Precise error
 */
#define CSR_MECC_CODE_P_MASK (0x20000UL)
#define CSR_MECC_CODE_P_SHIFT (17U)
#define CSR_MECC_CODE_P_GET(x) (((uint32_t)(x) & CSR_MECC_CODE_P_MASK) >> CSR_MECC_CODE_P_SHIFT)

/*
 * C (RO)
 *
 * Correctable error. This bit is updated on parity/ECC error exceptions.
 * 0:Uncorrectable error
 * 1:Correctable error
 */
#define CSR_MECC_CODE_C_MASK (0x10000UL)
#define CSR_MECC_CODE_C_SHIFT (16U)
#define CSR_MECC_CODE_C_GET(x) (((uint32_t)(x) & CSR_MECC_CODE_C_MASK) >> CSR_MECC_CODE_C_SHIFT)

/*
 * CODE (RW)
 *
 * This field records the ECC value on ECC error exceptions. This field is also used to read/write the ECC codes when diagnostic access of ECC codes are enabled (milmb.RWECC or mdlmb.RWECC is 1).
 */
#define CSR_MECC_CODE_CODE_MASK (0x7FU)
#define CSR_MECC_CODE_CODE_SHIFT (0U)
#define CSR_MECC_CODE_CODE_SET(x) (((uint32_t)(x) << CSR_MECC_CODE_CODE_SHIFT) & CSR_MECC_CODE_CODE_MASK)
#define CSR_MECC_CODE_CODE_GET(x) (((uint32_t)(x) & CSR_MECC_CODE_CODE_MASK) >> CSR_MECC_CODE_CODE_SHIFT)

/* Bitfield definition for register: MNVEC */
/*
 * MNVEC (RO)
 *
 * Base address of the NMI handler. Its value is the zero-extended value of the reset_vector.
 */
#define CSR_MNVEC_MNVEC_MASK (0xFFFFFFFFUL)
#define CSR_MNVEC_MNVEC_SHIFT (0U)
#define CSR_MNVEC_MNVEC_GET(x) (((uint32_t)(x) & CSR_MNVEC_MNVEC_MASK) >> CSR_MNVEC_MNVEC_SHIFT)

/* Bitfield definition for register: MXSTATUS */
/*
 * PDME (RW)
 *
 * For saving previous DME state on entering a trap. This field is hardwired to 0 if data cache and data local memory are not supported.
 */
#define CSR_MXSTATUS_PDME_MASK (0x20U)
#define CSR_MXSTATUS_PDME_SHIFT (5U)
#define CSR_MXSTATUS_PDME_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_PDME_SHIFT) & CSR_MXSTATUS_PDME_MASK)
#define CSR_MXSTATUS_PDME_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_PDME_MASK) >> CSR_MXSTATUS_PDME_SHIFT)

/*
 * DME (RW)
 *
 * Data Machine Error flag. It indicates an exception occurred at the data cache or data local memory (DLM). Load/store accesses will bypass D-Cache when this bit is set. The exception handler should clear this bit after the machine error has been dealt with.
 */
#define CSR_MXSTATUS_DME_MASK (0x10U)
#define CSR_MXSTATUS_DME_SHIFT (4U)
#define CSR_MXSTATUS_DME_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_DME_SHIFT) & CSR_MXSTATUS_DME_MASK)
#define CSR_MXSTATUS_DME_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_DME_MASK) >> CSR_MXSTATUS_DME_SHIFT)

/*
 * PIME (RW)
 *
 * When mcause is imprecise exception (in the form of an interrupt), the PM field records the privileged mode of the instruction that caused the imprecise exception. The PM field encoding
 * is defined as follows:
 * 0: User mode
 * 1: Supervisor mode
 * 2: Reserved
 * 3: Machine mode
 */
#define CSR_MXSTATUS_PIME_MASK (0x8U)
#define CSR_MXSTATUS_PIME_SHIFT (3U)
#define CSR_MXSTATUS_PIME_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_PIME_SHIFT) & CSR_MXSTATUS_PIME_MASK)
#define CSR_MXSTATUS_PIME_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_PIME_MASK) >> CSR_MXSTATUS_PIME_SHIFT)

/*
 * IME (RW)
 *
 * When mcause is imprecise exception (in the form of an interrupt), the PM field records the privileged mode of the instruction that caused the imprecise exception. The PM field encoding
 * is defined as follows:
 * 0: User mode
 * 1: Supervisor mode
 * 2: Reserved
 * 3: Machine mode
 */
#define CSR_MXSTATUS_IME_MASK (0x4U)
#define CSR_MXSTATUS_IME_SHIFT (2U)
#define CSR_MXSTATUS_IME_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_IME_SHIFT) & CSR_MXSTATUS_IME_MASK)
#define CSR_MXSTATUS_IME_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_IME_MASK) >> CSR_MXSTATUS_IME_SHIFT)

/*
 * PPFT_EN (RW)
 *
 * When mcause is imprecise exception (in the form of an interrupt), the PM field records the privileged mode of the instruction that caused the imprecise exception. The PM field encoding
 * is defined as follows:
 * 0: User mode
 * 1: Supervisor mode
 * 2: Reserved
 * 3: Machine mode
 */
#define CSR_MXSTATUS_PPFT_EN_MASK (0x2U)
#define CSR_MXSTATUS_PPFT_EN_SHIFT (1U)
#define CSR_MXSTATUS_PPFT_EN_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_PPFT_EN_SHIFT) & CSR_MXSTATUS_PPFT_EN_MASK)
#define CSR_MXSTATUS_PPFT_EN_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_PPFT_EN_MASK) >> CSR_MXSTATUS_PPFT_EN_SHIFT)

/*
 * PFT_EN (RW)
 *
 * Enable performance throttling. When throttling is enabled, the processor executes instructions at the performance level specified in mpft_ctl.T_LEVEL. On entering a trap:
 * PPFT_EN  <= PFT_EN;
 * PFT_EN <= mpft_ctl.FAST_INT ? 0 :PFT_EN;
 * On executing an MRET instruction:
 * PFT_EN <= PPFT_EN;
 * This field is hardwired to 0 if the PowerBrake feature is not supported.
 */
#define CSR_MXSTATUS_PFT_EN_MASK (0x1U)
#define CSR_MXSTATUS_PFT_EN_SHIFT (0U)
#define CSR_MXSTATUS_PFT_EN_SET(x) (((uint32_t)(x) << CSR_MXSTATUS_PFT_EN_SHIFT) & CSR_MXSTATUS_PFT_EN_MASK)
#define CSR_MXSTATUS_PFT_EN_GET(x) (((uint32_t)(x) & CSR_MXSTATUS_PFT_EN_MASK) >> CSR_MXSTATUS_PFT_EN_SHIFT)

/* Bitfield definition for register: MPFT_CTL */
/*
 * FAST_INT (RW)
 *
 * Fast interrupt response. If this field is set, mxstatus.PFT_EN will be automatically cleared when the processor enters an interrupt handler.
 */
#define CSR_MPFT_CTL_FAST_INT_MASK (0x100U)
#define CSR_MPFT_CTL_FAST_INT_SHIFT (8U)
#define CSR_MPFT_CTL_FAST_INT_SET(x) (((uint32_t)(x) << CSR_MPFT_CTL_FAST_INT_SHIFT) & CSR_MPFT_CTL_FAST_INT_MASK)
#define CSR_MPFT_CTL_FAST_INT_GET(x) (((uint32_t)(x) & CSR_MPFT_CTL_FAST_INT_MASK) >> CSR_MPFT_CTL_FAST_INT_SHIFT)

